Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ བློ་གྲོས་ དཔེ་མེད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Anupamamati.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རབ་ཏུ་ དགའ་བྱེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $597 Situated beyond that universe was a universe known as Causing Delight.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ ཀུན་ གྱི་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Source of All Good Qualities.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མཚན་མ་ མེད་པ འི་ མཚན་ཉིད་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Armor of the Characteristic of the Absence of Marks.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ དགའ་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $598 Situated beyond that universe was a universe known as Joy .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ མཐའ་ ཡ ས་ རིན་ཆེན་ ལྡན་ ཞེས་ བྱ་བ་ བཞུགས་ [84b] ཏེ་
en: There resided the thus-gone Possessor of the Jewel of Infinite Qualities.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཤིན་ཏུ་ ཡང་དག་ བརྟགས་ ཀྱི་ སྤྱོད་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Perfectly Accurate Activity.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ འཕགས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Glorious Noble Wisdom.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྒྲོགས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Proclaimer.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གདུགས་ ཀྱི་ ཕྲེང་བ་ བཀོད་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $600 Situated beyond that universe was a universe known as Array of Parasol Garlands.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ འཕགས་པ འི་ འོད་ ཀྱི་ གཟི་བརྗིད་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Glorious Splendor of the Light of Noble Wisdom.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ལེགས་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Sudatta.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ པད་མ་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendor of Growing Lotuses.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སངས་རྒྱས་ ཆོས་འབྱུང་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Source of Buddha Qualities.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མེ་ཏོག་ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $602 Situated beyond that universe was a universe known as Puṣpavati.

source: དེ་ ན་ དེ་ བཞིན་ གཤེགས་པ་ སྤོས་ རབ་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Leader of Finest Incense.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡེ་ཤེས་ དལ་བ་ འགྱུར་བྱེད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Wisdom Expander.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུ་མུ་ད ས་ རབ་ཏུ་ ཁེབས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $603 Situated beyond that universe was a universe known as Studded with Kumudas.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ་ ཏོག་ གི་ འོད་ཟེར་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Light Rays of the Moon Crest.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རི་རབ་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Sumerudatta.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡངས་ པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $604 Situated beyond that universe was a universe known as Viśala.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྤོས་ ཀྱི་ གླང་པོ་ཆེ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Gandhahastī.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མི་ འཁྲུགས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Akṣobhya.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཆོག་ ཅེས་ [85a] བྱ་བ་ ཡོད་ དེ །_
en: $605 Situated beyond that universe was a universe known as Supreme. [85.a]

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི འི་ འོད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Nectar Light.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བདུད་རྩི འི་ སྒྲ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Nectar Sound.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ ལྡན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $606 Situated beyond that universe was a universe known as Gandhavati .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ པད་མ་ བརྩེགས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Padmakūṭa.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མེ་ཏོག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Flower.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྤྱི་བོ ས་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Granted by the Crown.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཙམ་ པ་ཀ་ དང་ ལྡན་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $608 Situated beyond that universe was a universe known as Endowed with Campakas.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཙན་དན་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Candanaśrī.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་ ཆེན་ སྙིང་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $609 Situated beyond that universe was a universe known as Ratnagarbha.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ བརྩེགས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Ratnakūṭa.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཛངས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $610 Situated beyond that universe was a universe known as Learning .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མཛངས་ མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Supreme Learning.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཤིན་ཏུ་ རབ་ སངས་རྒྱས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Thoroughly Awakened.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བདེ་མཆོག་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $611 Situated beyond that universe was a universe known as Saṃvara .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བདེ་ མཛད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Kṣemangkara.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བདེ་བ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva King of Bliss.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རབ་གནས་ ཞེས་ བྱ་བ་ ཡོད་ [85b] དེ །_
en: $612 Situated beyond that universe was a universe known as Supratiṣṭhita. [85.b]

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ མཐའ་ ཡ ས་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendor of the Arising of Infinite Qualities.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཤིན་ཏུ་ རབ་གནས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Supratiṣṭhita.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ འོད་ ཅེས་བྱ་བ་ ཡོད་ དེ་
en: $613 Situated beyond that universe was a universe known as Prabhā.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་ ཀྱི་ ཏོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Luminous Crest.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཀུན་ཏུ་འོད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Samantaprabha.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ མཐའ་ ཡ ས་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Source of Limitless Qualities.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡོན་ཏན་ འབྱུང་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Guṇākara.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བལྟ་ ན་ སྡུག་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $615 Situated beyond that universe was a universe known as Sudarśana .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ ཐམས་ཅད་ འབྱུང་བ འི་ དཔལ་ གྱི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Glorious King of the Arising of All Good Qualities.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡོན་ཏན་ ལྡན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Endowed with Qualities.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $616 Situated beyond that universe was a universe known as Padmavati.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྦྱིན་ མོས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Concern for Generosity.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གསེར་ གྱི་ དྲ་བ ས་ ཀུན་ ཏུ་ ཁེབས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $617 Situated beyond that universe was a universe known as Draped with Nets of Gold.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྒྲོན་མ་ འཆང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Lamp Holder.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྦར་ འཆུམས་ མ་ ཡིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Not Craving for Fire.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་ཆེན་ དྲ་བ ས་ ཀུན་ ཏུ་ ཁེབས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $618 Situated beyond that universe was a universe known as Draped with Jewel Nets.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ འཕགས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendid Noble Jewel.

source: བཅོམ་ལྡན་འདས་ [86a] དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ གྲོང་ཁྱེར་ སྒྲོགས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Proclaimer in the City.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མངོན་པར་ འཕགས་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Superior King.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མི་ ཁོམ་ ཐམས་ཅད་ འགྱུར་བྱེད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Transformer of Everything Inopportune.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གདུགས་ གཅིག་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $620 Situated beyond that universe was a universe known as Single Parasol .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྒྱུ་སྐར་ གྱི་ ཕྲེང་བ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Nakṣatravali.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ནམ་མཁ འི་ རིགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $621 Situated beyond that universe was a universe known as Sky Family .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ལྷུན་པོ་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Infinite Mountain.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ནམ་ མཁ འི་ རྣ་ཆ་ གདུབ་ འཁོར་ རྣམ་པར་ དག་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone King of the Pure Ear Ornaments of Space.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Acintyaśrī.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མངོན་དུ་ བགྲོད་ པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $623 Situated beyond that universe was a universe known as Traversal.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི འི་ སྒྲ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Nectar Sound.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ རིགས་ བཙུན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $624 Situated beyond that universe was a universe known as Pure Incense Family.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མྱ་ངན་མེད་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Glorious Freedom from Suffering.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཤིན་ཏུ་ [86b] རྣམ་པར་ དག་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $625 Situated beyond that universe was a universe known as Suviśuddha. [86.b]

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ ལྷུན་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Jewel Mountain.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རིགས་ བཙུན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Pure Family.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རབ་ སྣང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $626 Situated beyond that universe was a universe known as Thorough Illumination.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མེ་ཏོག་ སྣ་ཚོགས་ མེ་ཏོག་ ཀུན་ ཏུ་ རྒྱས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Blooming Abundance of Precious Flowers.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བློ་གྲོས་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Anantamati.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཐུ་དཔལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $627 Situated beyond that universe was a universe known as Glorious Power .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བ་ལང་ བདག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Gavampati.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྡུལ་མེད་ རྡུལ་བྲལ་ རྣམ་པར་ གྲོལ་བ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Armor of Pure and Stainless Liberation.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ འོད་བྱེད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Prabhaṅkara.

source: དེ འི་ ཡང་ འདབ་ ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གསེར་ དུ་ སྣང་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $629 Situated beyond that universe was a universe known as Appearing as Gold.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ གསེར་ གྱི་ མེ་ཏོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Golden Flower.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྣམ་པར་ སྣང་བྱེད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Vairocana.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ ཁང་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Jewel Mansion.

source: དེ འི་ ཡང་ འདབ་ ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྙིང་པོ་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $631 Situated beyond that universe was a universe known as Essential.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མེ་ཏོག་ སྣ་ཚོགས་ འབྱུང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Source of Diverse Flowers.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དཔ ས་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Śūrdatta. [87.a]

source: [87a] དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲོལ་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $632 Situated beyond that universe was a universe known as Liberated .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ གྲོལ་བ འི་ འོད་ཟེར་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ །_
en: There resided the thus-gone Light Rays of Liberation.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་ དཔའ་ རྒྱལ་ཚབ་ བྱམས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Maitreya.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མེ་ཏོག་ རབ་ གཏོར་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $633 Situated beyond that universe was a universe known as Tossed Flowers.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མེ་ཏོག་ འབྱུང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Source of Flowers.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མེ་ཏོག་ གི་ གདུགས་ མེ་ཏོག་ ཀུན་ ཏུ་ རྒྱས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Blooming Flower Parasol.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མེ་ཏོག་ གདུགས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Flower Parasol.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་ དཔའ་ རྒྱལ་ཚབ་ གསེར་ གདུགས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Golden Parasol.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $635 Situated beyond that universe was a universe known as Padmavati.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དོན་ཡོད་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Meaningful Armor.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་ དཔའ་ རྒྱལ་ཚབ་ ལོག་པ འི་ གོ་ཆ་ བགོས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Bearer of the Armor against Wrongdoing.

source: བཅོམ་ལྡན་ འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྐྱེད་བྱེད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Janaka.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཚངས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $637 Situated beyond that universe was a universe known as Brahmāśrī.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཚངས་པ འི་ དབྱངས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Brahmāghoṣa.

source: བཅོམ་ ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ འཇམ་པ འི་ དབྱངས་ ཀྱི་ ང་རོ་ ཞེས་ བྱ་བ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས་ བཏང་ ངོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: This blessed one now dispatched his regent, the bodhisattva Roar of Mañjuśrī, having prophesied the latter’s awakening to unsurpassable and perfect buddhahood.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཏོག་ གི་ རྒྱལ་མཚན་ [87b] ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $638 Situated beyond that universe was a universe known as Top Banner [87.b] .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Vṛṣabha.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མིག་ རྣམ་དག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Pure Eye.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཏོག་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $639 Situated beyond that universe was a universe known as Crest.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མཐའ་ ཡ ས་ ཚོགས་ཅན་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Possessor of Infinite Accumulations.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རིགས་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Infinite Potential.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གསེར་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $640 Situated beyond that universe was a universe known as Gold .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྡེ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Sena.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རབ་གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $641 Situated beyond that universe was a universe known as Supratiṣṭhita .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཐོགས་པ་ མེད་པ འི་ འཁོར་ལོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Unimpeded Wheel.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ འདས་པ་ རྣམ་པར་ གནོན་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Subduer of Transcendence.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྲིད་ པ་ མེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $642 Situated beyond that universe was a universe known as Abhava.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འགྲོ་ ཀུན་ རྣམ་པར་ འཇོམས་ མཛད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Conqueror of All Realms.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཤིན་ཏུ་ ཡང་དག་ བརྟགས་ ཀྱི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Armor of Perfect Analysis.

source: དེ འི་ ཡང་ འདབ་ ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡིད་གཉིས་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $643 Situated beyond that universe was a universe known as In Two Minds.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡིད་གཉིས་ ཡང་དག་ འཇོམས་པ ར་ མཛད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Conqueror of All Doubt.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མཐོང་ མ་ ཐག་ ཏུ་ ངེས་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Armor of Ascertainment Immediately upon Sight.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡེ་ཤེས་ མཆོག་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $644 Situated beyond that universe was a universe known as Jñānavara.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ [88a] རྣམ་པར་ བལྟས་པ འི་ ང་རོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva [88.a] Roar of Sight.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ རབ་གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $645 Situated beyond that universe was a universe known as Stable Qualities.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ མཐའ་ ཡ ས་ ལྡན་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Possessor of Infinite Qualities.

source: བཅོམ་ ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ གོམ་པ་ མཐའ་ ཡ ས་ རྣམ་པར་ གནོན་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Subduer with Infinite Steps.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་ཆེན་ རབ་གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $646 Situated beyond that universe was a universe known as Stable Jewels.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Glorious Source of Jewels.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྡོ་རྗེ་ རྣམ་པར་ གནོན་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Vajra Subduer.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རིན་ཆེན་ མེ་ཏོག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Jewel Flower.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ་ འབྱུང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $648 Situated beyond that universe was a universe known as Ratnākara .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མཆོག་ ཅེས་བྱ་ བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Ratnavara.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཚངས་ མཆོག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Brahmottara.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ལེགས་ འབྱུང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $649 Situated beyond that universe was a universe known as Source of Goodness.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འདས་པ་ དང་ མ་འོངས་ པ་ དང་ །_ ད་ལྟ ར་ བྱུང་བ འི་ གོ་ཆ་ ཐོགས་པ་ མེད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Unimpeded Armor of Past, Future, and Present.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྡུལ་བྲལ་ སྡེ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Stainless Army.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཤིན་ཏུ་ གནོན་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Suvikrānta.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྣམ་དག་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $651 Situated beyond that universe was a universe known as Viśuddha. [88.b]

source: [88b] དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ ལྷུན་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Jewel Mountain.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ལྷུན་པོ་ ཆེན་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Great Mountain.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཟླ་བ་ སྒྲོན་མ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $652 Situated beyond that universe was a universe known as Candrapradīpa .

source: དེ་ ན་ དེ་ བཞིན་ གཤེགས་པ་ ཉི་མ་ སྒྲོན་མ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Sūryapradīpa.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཉི་མ་ སྒྲོན་མ་ མངོན་པར་ འཕགས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Superior Glory of the Sun Lamp.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཚོན་རྩི འི་ ཕུང་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $653 Situated beyond that universe was a universe known as Color Heap.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དྲི་མེད་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Splendor of the Source of Stainlessness.
